Тестовое задание:
Создать API для мобильного приложения фитнес трекера.
Пользователь регистрируется в приложении с помощью электронной почты с подтверждением адреса.
Приложение отправляет на сервер отчёты об активности пользователя.
Отчёт содержит следующие данные:
1. Дата и время начала активности;
2. Дата и время окончания активности;
3. Тип активности (ходьба, бег, велосипед);
4. Расстояние;
5. Количество калорий.
Приложение может запрашивать статистику по пользовательским активностям с возможностью агрегирования за час и за сутки.
Используемые технологии: Django, Django Rest Framework, PostgreSQL.
Можно использовать любые дополнительные библиотеки по желанию.
Выложите результат на gitlab и отправьте ссылку.
